our_optimization/eval_results_c2/6.1.4-cs614-c2-patched/fio_perf.txt
allocstall: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
...
fio-3.36
Starting 4 processes
allocstall: Laying out IO file (1 file / 2048MiB)
allocstall: Laying out IO file (1 file / 2048MiB)
allocstall: Laying out IO file (1 file / 2048MiB)
[...]

allocstall: (groupid=0, jobs=4): err= 0: pid=10562: Wed Apr 22 23:23:42 2026
  write: IOPS=620, BW=620MiB/s (650MB/s)(8192MiB/13207msec); 0 zone resets
    clat (usec): min=369, max=44229, avg=6323.68, stdev=9830.67
     lat (usec): min=386, max=44245, avg=6347.59, stdev=9827.25
    clat percentiles (usec):
     |  1.00th=[  404],  5.00th=[  429], 10.00th=[  445], 20.00th=[  474],
     | 30.00th=[  498], 40.00th=[  529], 50.00th=[  570], 60.00th=[  668],
     | 70.00th=[ 1336], 80.00th=[17171], 90.00th=[23987], 95.00th=[26084],
     | 99.00th=[33817], 99.50th=[34866], 99.90th=[36439], 99.95th=[39060],
     | 99.99th=[44303]
   bw (  KiB/s): min=436003, max=1686564, per=100.00%, avg=646413.49, stdev=67184.43, samples=102
   iops        : min=  425, max= 1645, avg=630.57, stdev=65.58, samples=102
  lat (usec)   : 500=30.96%, 750=32.74%, 1000=4.39%
  lat (msec)   : 2=3.11%, 4=0.72%, 10=0.65%, 20=12.62%, 50=14.81%
  cpu          : usr=0.42%, sys=9.08%, ctx=6760, majf=0, minf=49
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=620MiB/s (650MB/s), 620MiB/s-620MiB/s (650MB/s-650MB/s), io=8192MiB (8590MB), run=13207-13207msec

Disk stats (read/write):
  loop18: ios=0/9171, sectors=0/16511480, merge=0/0, ticks=0/321968, in_queue=322198, util=96.07%